cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# holman's
#brew 'ruby-build'
# brew 'spaceman-diff'
cask '1password'
cask 'sonos'
cask 'warp'
cask 'whatsapp'
cask 'visual-studio-code'

## Other Dev tools

brew 'git-lfs'

# Heroku CLI
tap 'heroku/brew'
brew 'heroku'

# puma-dev
brew 'puma/puma/puma-dev'

# AWS CLI
brew 'awscli'
cask 'session-manager-plugin'

# MySQL
brew 'mysql@8.0'
brew 'mysql@5.7'

# Node
brew 'fnm'

# PostgreSQL
brew 'postgresql@13'

## Various utilities
brew 'coreutils' # for various system commands in terminal
brew 'gpg'
# brew php
